### KAWOOMA ELIJAH
### M24B38/023
### B29158

#### HANDLING MISSING VALUES ASSIGNMENT 1

In [1]:
##calling the neccessary libraries
import pandas as pd #for creating a dataframe
import seaborn as sn #for visualisations

In [2]:
data = pd.read_excel("C:/Users/STUDENTS/Desktop/Elijah_Kaizzi_B29158/Python/Learning/year2/Student_performance.xlsx")
data

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

- Getting a statistical overview of the data

In [4]:
data.describe(include= 'all')

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
count,11.000000,11,11.000000,10,10.000000,10.000000,11.000000,11.000000
unique,NaN,2,NaN,3,NaN,NaN,NaN,NaN
top,NaN,female,NaN,Computer_Science,NaN,NaN,NaN,NaN
freq,NaN,6,NaN,4,NaN,NaN,NaN,NaN
mean,496.545455,NaN,21.454545,NaN,63.200000,76.300000,70.090909,62.818182
std,278.903339,NaN,0.522233,NaN,24.220285,16.418486,18.030278,25.956957
min,123.000000,NaN,21.000000,NaN,25.000000,40.000000,38.000000,19.000000
25%,317.500000,NaN,21.000000,NaN,47.250000,70.000000,64.500000,42.000000
50%,415.000000,NaN,21.000000,NaN,67.500000,76.500000,78.000000,65.000000
75%,723.500000,NaN,22.000000,NaN,85.000000,86.000000,79.000000,86.500000
max,892.000000,NaN,22.000000,NaN,91.000000,98.000000,92.000000,93.000000

- Checking for the data types of all the variables

In [5]:
data.dtypes

Access_no      int64
gender        object
age            int64
course        object
DSC3108      float64
DSC3114      float64
MTH3108        int64
SYE3104        int64
dtype: object

- Checking for the missing values for each individual column

In [9]:
data.isna().sum()

Access_no    0
gender       0
age          0
course       1
DSC3108      1
DSC3114      1
MTH3108      0
SYE3104      0
dtype: int64

- Handling the missing values

In [ ]:
###For the categorical variables 
cat_vars =  data[data,exclude]